# AlignmentStationLabel Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AlignmentStationLabel Methods
AlignmentStationLabel Class See Also
---
The AlignmentStationLabel type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an AlignmentStationLabel object along with its underlying SpotDimension element. Returns null if element creation fails. |
| CreateRecommendedTypeForSet | Creates an element type recommended for alignment label sets and returns its ElementId. |
| CreateSet | Creates a collection of AlignmentStationLabel objects along with their underlying SpotDimension elements. |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Get | Returns an AlignmentStationLabel object for the given element. |
| GetAlignmentStationLabels(Alignment) | Returns all alignment station labels placed on the given alignment. |
| GetAlignmentStationLabels(Alignment, ElementId) | Returns all alignment station labels placed on the given alignment in the given view. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsRecommendedTypeForSet | Checks if the element type is recommended for alignment labels in sets. |
| IsValid()()()() | Checks if this object is a valid alignment station label. |
| IsValid(Element) | Checks if the element is a valid alignment station label. |
| IsValidType | Checks if the type is a valid alignment station label type. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace